/* eslint-disable no-useless-escape */
/**
 * @Description:
 * @author 赵文龙
 * @date $
 */
export default {
  // 不能输入表情
  noEmoji: {
    pattern: /^[\u4e00-\u9fa5_a-zA-Z0-9]+$/,
  },
  // 手机号
  phone: {
    pattern: /^1(3\d|4[5-9]|5[0-35-9]|6[2567]|7[0-8]|8\d|9[0-35-9])\d{8}$/,
    msg: '请输入正确的手机号码',
  },
  password: {
    pattern:
      /^(?![0-9]+$)(?![a-z]+$)(?![A-Z]+$)(?![!@#\$%\^&\*\(\)_\+\=-`~,\.\/;'<>\?:"\\|\[\]]+$)[!@#\$%\^&\*\(\)_\+\=-`~,\.\/;'<>\?:"\\|\[\]0-9A-Za-z]{8,20}$/,
    msg: '请设置8-20位密码，英文、数字、特殊字符最少两种组合',
  },
  email: {
    pattern: /^[A-Za-z\d]+([-_.][A-Za-z\d]+)*@([A-Za-z\d]+[-.])+[A-Za-z\d]{2,5}$/,
  },
  number: {
    pattern: /^\d+$/,
  },
  // 身份证号
  idNumber: {
    pattern: /^[1-9]\d{5}(18|19|20|(3\d))\d{2}((0[ 1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
  },
  // 统一社会信用代码
  unifiedCode: {
    // 18位阿拉伯数字或大写英文字母
    pattern: /^[A-Za-z0-9]{18}$/,
  },
  // 员工卡号（数字或字母）
  cardNo: {
    pattern: /^[0-9a-zA-Z]+$/,
  },
  // 用户名
  account: {
    pattern: /^[a-zA-z]\w{3,15}$/,
    msg: '账号长度4-16位,字母、数字、下划线组成，字母开头',
  },
};
